from typing import Final


FILL_LESSON_GAPS_Q: Final[str] = \
"""
Оооотлично! Давай заполним пропуски за {d}!\n
Если передумаешь, то напиши в любой момент \"Отмена\"\n\n
Сколько уроков?
"""
FILL_LESSON_GAPS_ERROR: Final[str] = "😢 Нужно ввести число и тогда мы сможем продолжить!"
FILL_LESSON_GAPS_OK: Final[str] = "Супер, записала {lessons} уроков на {date}."
CANCEL: Final[str] = "Хорошо! Пиши снова если потребуется помощь 😉"
CHOOSE_STUDENT: Final[str] = "Выбери ученика для которого нужно внести запись."
