from typing import Final


FILL_LESSON_GAPS_Q: Final[str] = \
"""
Оооотлично! Давай заполним пропуски за {d}!
Если передумаешь, то напиши в любой момент \"Отмена\"\n\n
Сколько уроков?
"""
FILL_LESSON_GAPS_ERROR: Final[str] = "😢 Нужно ввести число и тогда мы сможем продолжить!"
FILL_LESSON_GAPS_OK: Final[str] = "Супер, записала {lessons} уроков на {date}."
CANCEL: Final[str] = "Хорошо! Пиши снова если потребуется помощь 😉"
CHOOSE_STUDENT: Final[str] = "Выбери ученика для которого нужно внести запись"
NO_REGISTRY_ERROR: Final[str] = "Извини, но тебя нет в моей системе, давай начнем сначала - /start :)"

NEED_STUDENTS: Final[str] = "\nДля работы заполни данные об учениках:\nперечисли их фамилии через пробел: `/students Первый Второй Третий...`"

NO_STUDENTS_ERROR: Final[str] = NEED_STUDENTS
REGISTER_OK: Final[str] = "Привет! Рада знакомству :)" + NEED_STUDENTS
REGISTER_FALL: Final[str] = "Я уже знаю о тебе :)"
FILL_STUDENTS_OK: Final[str] = "Всё супер! Добавила твоих учеников :)"
STUDY_EXIST: Final[str] = "На сегодняшний день есть запись на {lessons} уроков"

REASONS_MAP = {
    'excused': '🎓 Увж. причина',
    'sick': '😷 Болеет',
    'cut': '🚶 Прогул' 
}
BACK_TO: Final[str] = "⬅️ Назад к ученикам"
REASON_Q: Final[str] = "По какой причине нет {name}?"
REASON_SKIPS_Q: Final[str] = \
"""🗿 Ученик: {name}
Причина: {reason}
Сколько пропущенных?
"""
ALL_LESSONS_BTN: Final[str] = "Все уроки"
CHOOSE_COUNT_BTN: Final[str] = "Указать количество"
ABSENCES_ADD_TXT: Final[str] = "Отмечено {absences} уроков для {name} по причине {reason}"